{
    "header": {
        "title2": "Full Stack Developer",
        "about": "About",
        "contact": "Contact Me",
        "cv": "Download CV"
    },
    "body": {
        "home": "Hi! I'm a full stack developer specialised on the front-end and on build modern, functional and accessible digital experiences.",
        "homep": "Read More <a href='resume.html'><i class='fa-regular fa-circle-right'></i></a>",
        "desktop-github": "Check my full portfolio on Github",
        "home2-title": "What I Do",
        "home2-subtitle": "🌐 Frontend development (React, JavaScript, responsive design):",
        "home2-paragraph": "I build fast, responsive, and accessible websites using HTML, CSS, and modern JavaScript - with a strong focus on React and clean UI/UX",
        "home2-subtitle2": "🧠 Backend APIs (Django REST, CRUD operations, authentication)",
        "home2-paragraph2": "I create robust backend applications and APIs using Django, Django REST Framework, Express and Node.js, to handle data, logic and integrations.",
        "home2-subtitle3": "🛠️ Full project deployment (GitHub Pages, Heroku, Vercel, Render)",
        "home2-paragraph3": "From coding to deployment - I manage the full process using Git, GitHub, and platforms like Heroku or Github Pages.",
        "home2-subtitle4": "📈 Performance & Accessibility",
        "home2-paragraph4": "I optimize every project for speed, mobile responsiveness, and accessibility, ensuring a smooth user experience on any device.",
        "carousel-description1": "Sneakers Vault - E Commerce Website for a fictional sneakers online shop, made with React and Express, using Stripe sandbox for mock payment system.",
        "carousel-description2": "Pictures And Places - Interactive Geography game made with Javascript and with a backend database to store player scores.",
        "carousel-description3": "Sapore Di Mare - Fictional Restaurant's Website made with Django, that features a booking system and admin panel for management.",
        "carousel-description4": "Login page for a social network website, made using React and DjangoRest frameworks.",
        "carousel-description5": "Sapore Di Mare's booking system.",
        "carousel-description6": "Sneakers Vault payment mock system powered by Stripe Sandbox.",
        "contact-me": "<a href='contact.html'>Let's work together!</a>"
    },
    "about": {
        "title": "About Me",
        "about-p": "I had my first working experiences in logistics and retail, until i moved to London in 2015 and I started working in the hospitality industry. I spent nearly ten years in the UK, growing both professionaly and personally while working in high-end restaurants and private member clubs.",
        "about-p2": "Over the time though i felt the need for a change, something that would allow me to create, learn continuously, and work remotely. <br> That's when I decided to reinvent myself and to start my journey into tech. In 2024, I enrolled for the <a href='https://codeinstitute.net/global/' target='_blank'>Code Institute</a>'s Full Stack Developer Course, and started studying web development, gradually transitioning into a more creative and fulfilling career path, eventually leaving my job in hospitality, and achieved my diploma. <br> ",
        "about-p3": "This journey taught me resilience, discipline, and the importance of building things and pursue goals that are both functional and meaningful. <br> Now, I help individuals and businesses bring their ideas to life through intuitive, responsive, and visually engaging websites — while continuing to develop my own projects with creativity and passion.",
        "timeline-month1": "May 2024",
        "timeline-title1": "Started my Journey",
        "timeline-p1": "Enrolled for the Code Institute Full stack Developer Course",
        "timeline-month2": "June 2024",
        "timeline-title2": "HTML & CSS",
        "timeline-p2": "Started learning HTML and CSS and built my first project.",
        "timeline-month3": "August 2024",
        "timeline-title3": "JavaScript & DOM",
        "timeline-p3": "Started learning and working with JavaScript and Python, also building my first two projects using these languages.",
        "timeline-month4": "November 2024",
        "timeline-title4": "Django and PostgreSQL",
        "timeline-p4": "Started working with Django and PostgreSQL databases and built my first full stack project.",
        "timeline-month5": "March 2025",
        "timeline-title5": "React",
        "timeline-p5": "First started working with React and built my last project to complete the course using this framework.",
        "timeline-month6": "July 2025",
        "timeline-title6": "Achieved Course Graduation",
        "timeline-p6": "Completed the Code Institute Full Stack developer course.",
        "timeline-month7": "Today",
        "timeline-title7": "Building and Networking",
        "timeline-p7": "Keeping on building and improving my portfolio, while strengthening my knowledge of programming languages and frameworks, developing for small businesses and professionals, and looking for new collaborations.",
        "collab2": "Feel free to <a href='contact.html'>get in touch</a> or check out more of my work on <a href='https://github.com/alelodato' target='_blank'>GitHub</a>."
    },
    "contact": {
        "title": "Got a project in mind?",
        "title2": "Let's work together!",
        "button": "Send"
    }
}